In [1]:
import pandas as pd
import string
import re

#### Question 1
Write a [one-line] Python lambda function, named `lambdaAdder`, that will take two inputs: The first is a list and the second input should be an integer. The second parameter should be optional with a default value of 1. The result of the function (aka: whats returned) should be a new list where each element has been summed with the second parameter's value. **You must do this with a lambda function to receive credit**

Note: 
    *Lambda functios do not start with def*

In [2]:
lambdaAdder = lambda x,y=1: [i + y for i in x]
mylist = [1,2,3,4,5,6,7]

In [3]:
lambdaAdder(mylist), lambdaAdder(mylist, 10)

([2, 3, 4, 5, 6, 7, 8], [11, 12, 13, 14, 15, 16, 17])

#### Question 2
Write a Python function, named `listToDict`, that will take two lists as input. The resulting output should be a dictionary with keys coming from the first list and they values from the second. If the two input lists are not of equal size, return an error message.

In [4]:
def listToDict(list1, list2):
    assert len(list1) == len(list2), "Not of equal size!"
    return dict(zip(list1, list2))

In [5]:
list2 = ['a','b','c','d','e','f','g']
listToDict(list2, mylist)

{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5, 'f': 6, 'g': 7}

#### Question 3
Write a Python function, named `WordCount`, that will take a string as an input and count the number of words in the string. (This can be accomplished in a single line.)

In [6]:
#sample data
macbeth = open('Data/Macbeth.txt').read()

In [28]:
WordCount = lambda x: len(re.split(r"[' '\n]", x.strip()))

In [29]:
WordCount(macbeth)

18884

#### Question 4
Write a Python function, named `UniqueChars`,  that  will  that will take a string as an input, converts the text to all lowercase, and then returns a list of tuples containing all of the unique alpha characters (characters being A-Z. Not actors in macbeth) in the text file paired with how many times that character appears. (ex. [(a,78), (b,16), ...]). The list should be ordered a-z

In [11]:
az = string.ascii_lowercase
def UniqueChars(st):
    s = st.lower() 
    lis = []
    lis2 = []
    tup = tuple()
    for c in s:
        lis.append(c)
    for i in az:
        tup = lis.count(i)
        lis2.append(tup)
    mask = dict(zip(list(az), lis2))
    lis3 = list(mask.items())
    return lis3

In [12]:
UniqueChars(macbeth)

[('a', 6031),
 ('b', 1467),
 ('c', 2157),
 ('d', 3341),
 ('e', 9307),
 ('f', 1704),
 ('g', 1338),
 ('h', 5273),
 ('i', 4675),
 ('j', 38),
 ('k', 691),
 ('l', 3306),
 ('m', 2482),
 ('n', 5010),
 ('o', 6062),
 ('p', 1003),
 ('q', 121),
 ('r', 4534),
 ('s', 4956),
 ('t', 7088),
 ('u', 2596),
 ('v', 657),
 ('w', 1940),
 ('x', 112),
 ('y', 1639),
 ('z', 15)]

#### Question 5
Write a Python function, named txtToPd,that will take a string as input and will output the data from the string as a pandas DF. For this exercise, assume all columns in the string are separated by '\t' and that all rows are separated by '\n'. The string will contain headers. Refer to the below sample strings for formatting.

Notes: 
   *not all input strings will require the same number of columns* <br/>
   *numeric values should be cast accordingly -- cosider the way of try/except* <br/>
   *The .split() method would be very helpful here* <br/>
   *check your resulting dataframes for any errors*

In [13]:
#sample strings
actors_str = open('Data/movies/actors.txt').read()
movies_str = open('Data/movies/movies.txt').read()
isin_str = open('Data/movies/isin.txt').read()

In [14]:
def txtToPd(string):
    new = re.split(r"[\t\n]", string.strip())
    lis2 = []
    index = []
    for i in new:
        try:
            i = int(i)
            lis2.append(i)
        except:
            lis2.append(i)
    count = 0
    for i in lis2:
        count+=1
        if isinstance(i, int) == True:
            break
        else:
            continue
    index = pd.DataFrame([i for i in lis2[::(count-1)]])
    firstc = pd.DataFrame([i for i in lis2[1::(count-1)]])
    secondc = pd.DataFrame([i for i in lis2[2::(count-1)]])
    if (count-1)>3:
        thirdc = pd.DataFrame([i for i in lis2[3::(count-1)]])
        df = pd.concat([index, firstc, secondc, thirdc], axis=1)
    else:
        df = pd.concat([index, firstc, secondc], axis=1)
    header = df.iloc[0]
    df = df.iloc[1:]
    df.columns = header
    return df

In [15]:
txtToPd(movies_str)

0    mid                         title  year grade
1      1           A Face in the Crowd  1957     9
2      2              A Perfect Couple  1979     6
3      3               A Touch of Evil  1958     9
4      4           Across the Universe  2007     6
5      5                       Amadeus  1983     9
..   ...                           ...   ...   ...
796  796          Arsenic and Old Lace  1944     8
797  797       The Magic of Belle Isle  2012     5
798  798  The Women on the Sixth Floor  2010     7
799  799                Days of Heaven  1978     8
800  800                        Paulie  1998     5

[800 rows x 4 columns]

In [16]:
txtToPd(actors_str)

0    aid  firstname   lastname
1      1   Leonardo   DiCaprio
2      2       Andy   Griffith
3      3     Walter    Matthau
4      4      Orson     Welles
5      5  F. Murray    Abraham
..   ...        ...        ...
752  752        Lee     Majors
753  753        Pat  McCormick
754  754    Raymond     Massey
755  755    Leonard      Nimoy
756  756        Jim     Varney

[756 rows x 3 columns]

In [17]:
txtToPd(isin_str)

0       id mid  aid
1        1   3    4
2        2   2    2
3        3   2    3
4        4   5    5
5        5   6    6
...    ...  ..  ...
2359  2359   9   11
2360  2360   9   52
2361  2361   9  755
2362  2362   9  254
2363  2363   9  756

[2363 rows x 3 columns]

##### Question 5b
Usnig your txtToPd function above, create a dataframe for each of the 3 text data provided: actors_str, movies_str, and isin_str. Name the resulting dataframes: actors_df, movies_df, and isin_df, respectively.

In [18]:
actors_df = txtToPd(actors_str)
movies_df = txtToPd(movies_str)
isin_df = txtToPd(isin_str)

#### Question 6
Write a Python function, named `castCount`,that will take an actor/actress as an input and return how many times that person has been cast in the movies present in movies_df. The input for your function should consist of two required parameters of `firstname` and `lastname`. If there is no entity matching the inputted firstname and lastname, return -1. The function should be able to handle strange casing (ex. "DaViD"). For the sake of simplicity, assume the input must be a direct match.

In [19]:
def castCount(first, last):
    df = movies_df.merge(isin_df, on=['mid']).merge(actors_df, on=['aid'])
    first, last = first.title(), last.title()
    return df[(df.firstname == first) & (df.lastname == last)].shape[0]

In [20]:
castCount('lEe', 'rEmIck')

2

#### Question 7
Write a function named `TwoNames2Movies`. This will return a list of the titles of movies that two 
actors/actresses are in. The inputs are (firstname1, lastname1, firstname2, lastname2.

*For the sake of simplicity, the function can assume actors_df, movies_df, and isin_df exist in the global scope*

In [21]:
def TwoNames2Movies(f1, l1, f2, l2):
    lis = []
    f1, l1, f2, l2 = f1.title(), l1.title(), f2.title(), l2.title()
    df = movies_df.merge(isin_df, on=['mid']).merge(actors_df, on=['aid'])
    df2 = df[(df.firstname == f1) & (df.lastname == l1) | (df.firstname == f2) & (df.lastname == l2)].title
    lis.extend(df2[df2.duplicated()].tolist())
    return lis

In [23]:
comb = movies_df.merge(isin_df, on=['mid']).merge(actors_df, on=['aid'])
comb[comb.title == 'The Omen']

0     mid     title  year grade    id  aid firstname lastname
1     636  The Omen  1976     5  2050  684       Lee   Remick
1775  636  The Omen  1976     5  2049  429   Gregory     Peck

In [24]:
TwoNames2Movies('LEe', 'ReMick', 'grEgOry', 'pEck')

['The Omen']

#### Question 8
Write a function named `bestPerformer`. The input should be nmovies, a scalar value (integer). nmovies should 
have a default value of 5. The output is firstname, lastname, averageGrade of the actor/actress with the highest 
average movie grade. The variable nmovies is the minimum number of movies that the actor/actress has been in. However, your function should allow the user to change that variable to a different number when the function is called.
Thus, if the user wanted to require at least 6 movies then all they would have to do is,

bestPerformer(6) <br/>
*If there is a tie amongst performers, output the first in alphabetical order*

In [25]:
def bestPerformer(nmovies=5):
    df = movies_df.merge(isin_df, on=['mid']).merge(actors_df, on=['aid'])
    a_count = df.groupby(['aid', 'firstname', 'lastname']).count().reset_index()[['aid','firstname','lastname','title']]
    grade = df.groupby(['aid'])[['grade']].mean().reset_index() 
    both = a_count.merge(grade,on='aid')
    both = both[both.title == nmovies].sort_values('grade', ascending=False)[['firstname', 'lastname','grade']].rename(columns={'grade':'Avg Grade', 'firstname':'First Name', 'lastname':'Last Name'})
    score = both.iloc[0,2]
    count = 0
    for i in both['Avg Grade']:
        if i == score:
            count += 1
    return both.iloc[0:count].sort_values('First Name').reset_index(drop=True)

In [26]:
bestPerformer()

0 First Name Last Name  Avg Grade
0     Leo G.   Carroll        8.4

In [27]:
bestPerformer(2)

0 First Name  Last Name  Avg Grade
0      Debra     Winger       10.0
1     Marion  Cotillard       10.0
2     Zdenek     Sverak       10.0